import {toHumanReadableCase} from './utils.js';

const CITIES_KEY = 'Y_CITY_GAME';

const DEFAULT_CITIES = {
    "а": ["Аделаида", "Аккра", "Амстердам", "Анкара", "Антананариву", "Астана", "Афины"],
    "б": ["Багдад", "Бамако", "Банги", "Берлин", "Берн", "Бисмарк", "Бишкек", "Богота", "Бразилиа", "Брисбен", "Брюссель", "Будапешт", "Бухарест", "Буэнос-Айрес"],
    "в": ["Валлетта", "Варшава", "Вашингтон", "Веллингтон", "Виндхук", "Владимир", "Вологда"],
    "г": ["Гавана", "Гамильтон"],
    "д": ["Дакка", "Даллас", "Дамаск", "Дели", "Денвер", "Джексон", "Джуба", "Додома", "Доха", "Дублин", "Дуглас", "Душанбе"],
    "е": ["Евпатория", "Екатеринбург"],
    "ж": ["Желтые Воды", "Жуковский"],
    "з": ["Загреб", "Задар", "Западная Двина", "Зеленоград", "Зея"],
    "и": ["Иерусалим", "Исламабад", "Ишим"],
    "к": ["Кабул", "Каир", "Калгари", "Калининград", "Канберра", "Катманду", "Киев", "Кито", "Кишинёв", "Куала-Лумпур"],
    "л": ["Ла-Пас", "Леон", "Лима", "Лиссабон", "Лондон", "Лос-Анджелес", "Луанда", "Лусака"],
    "м": ["Мадрид", "Манагуа", "Манаус", "Мельбурн", "Мехико", "Минск", "Мозырь", "Монтевидео", "Морони", "Москва"],
    "н": ["Нассау", "Никосия", "Норильск", "Нью-Йорк"],
    "о": ["Остин", "Оттава"],
    "п": ["Панама", "Париж", "Пекин", "Перт", "Пирр", "Прага", "Пхеньян"],
    "р": ["Рига", "Роли"],
    "с": ["Сан-Франциско", "Сан-Хосе", "Сантьяго", "Сараево", "Сейлем", "Сент-Пол", "Сеул", "Сингапур", "Сиэтл", "Солт-Лейк-Сити", "София", "Сухум"],
    "т": ["Ташкент", "Тбилиси", "Тегеран", "Токио", "Триполи"],
    "у": ["Улан-Батор"],
    "ф": ["Финикс"],
    "х": ["Ханой", "Хелена", "Хобарт"],
    "ч": ["Чиуауа"],
    "ы": ["Ыспарта"],
    "э": ["Эль-Кувейт", "Эр-Рияд"],
    "я": ["Якутск", "Яссы", "Яунде"]
};

const cities = loadCities();

export function loadCities() {
    let storedCities = JSON.parse(localStorage.getItem(CITIES_KEY)) || Object.assign({}, DEFAULT_CITIES);

    Object.keys(storedCities).forEach(key => {
        storedCities[key] = new Set(storedCities[key].concat(DEFAULT_CITIES[key]));
    });

    return storedCities;
}

function save(cities) {
    const r = {};

    Object.keys(cities).forEach(key => r[key] = [...cities[key]]);

    localStorage.setItem(CITIES_KEY, JSON.stringify(r));
}

export function addCity(city) {
    const first = city[0].toLowerCase();

    city = toHumanReadableCase(city);

    if (cities[first]) {
        cities[first].add(city);
    } else {
        cities[first] = new Set([city]);
    }

    save(cities);
}
